; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	infrared2 - mode
	infrared4 - mode
	thermograph3 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star12)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared4)
	(have_image Star8 infrared2)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 thermograph3)
	(have_image Star12 infrared4)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 thermograph3)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 star12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star12)
   goals met: 0 of 10
5. (take_image satellite1 star12 instrument2 infrared4)
   added: (have_image star12 infrared4)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon7 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon7 instrument2 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 10
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 10
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 10
11. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 10
12. (turn_to satellite0 star12 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star12)
   goals met: 3 of 10
13. (turn_to satellite1 phenomenon10 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 10
14. (take_image satellite1 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 10
15. (turn_to satellite1 phenomenon11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 10
16. (take_image satellite1 phenomenon11 instrument1 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 5 of 10
17. (turn_to satellite1 phenomenon13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 10
18. (take_image satellite1 phenomenon13 instrument1 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 6 of 10
19. (turn_to satellite1 planet6 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet6)
   goals met: 6 of 10
20. (take_image satellite1 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 7 of 10
21. (turn_to satellite1 star14 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star14)
   goals met: 7 of 10
22. (take_image satellite1 star14 instrument1 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 8 of 10
23. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 8 of 10
24. (take_image satellite1 star8 instrument1 infrared2)
   added: (have_image star8 infrared2)
   goals met: 9 of 10
25. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
26. (take_image satellite1 star9 instrument1 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 10 of 10
